whitelist = [
    '000725',  # "京东方A", 面板全球第一
    '002222',  # "福晶科技", 全球最大LBO、BBO非线性光学晶体生产商
    '002241',  # "歌尔股份", 电声器件世界第一
    '002475',  # "立讯精密", AirPods全球组件供应商龙头
    '002415',  # "海康威视", 连续7年全球视频监控设备第一
    '300628',  # "亿联网络", SIP出货量全球第一
    '603160',  # "汇顶科技", 指纹芯片全球第一

    '600745',  # "闻泰科技", 全球最大手机代工企业
    '000063',  # "中兴通讯", 通信设备国内第一
    '600703',  # "三安光电", LED芯片国内第一
    '600588',  # "用友网络", 公有云SAAS国内第一
    '002230',  # "科大讯飞", 翻译机国内老大
    '603019',  # "中科曙光", 超算国内第一
    '002008',  # "大族激光", 激光切割第一
    '002371',  # "北方华创", IC设备第一
    '002841',  # "视源股份", 交互智能平板第一
    '300014',  # "亿纬锂能", 锂亚硫酰氯电池第一

    '002456',  # "欧菲光", 国内领先的精密光电薄膜元器件制造商
    '601360',  # "三六零", 杀毒第一
    '300454',  # "深信服", 虚拟专用网络连续11年国内第一
    '002410',  # "广联达", 建筑信息化第一
    '300207',  # "欣旺达", 智能手机电池世界第一
    '603659',  # "璞泰来", 人造石墨负极材料第一
    '000997',  # "新大陆", POS机国内第一
    '002583',  # "海能达", 专网通信终端第一
    '300782',  # "卓胜微", 射频芯片龙头
    '600460',  # "士兰微", 半导体IDM龙头

    '002439',  # "启明星辰", 堡垒机第一
    '002916',  # "深南电路", PCB华为供应商第一
    '600845',  # "宝信软件", 钢铁制造信息化第一品牌
    '002152',  # "广电运通", 11年银行设备第一
    '300676',  # "华大基因", 国内基因测序龙头
    '600756',  # "浪潮软件", 领先的电子政务、云计算服务商
    '300058',  # "蓝色光标", 国内为企业提供品牌管理服务行业龙头
    '600563',  # "法拉电子", 薄膜电容器制造龙头
    '300017',  # "网宿科技", CDN国内第一
    '002396',  # "星网锐捷", 16年瘦客户机第一
    '002153',  # "石基信息", 酒店信息化管理系统第一

    '300271',  # "华宇软件", 11年检察院法院信息化第一
    '002405',  # "四维图新", 汽车导航第一
    '000050',  # "深天马A", 车辆屏幕显示第一
    '002281',  # "光迅科技", 光通信器件第一
    '002463',  # "沪电股份", 多层印制电路板第一
    '002681',  # "奋达科技", 智能语音音响龙头
    '300750',  # "宁德时代", 锂电池龙头
    '000977',  # "浪潮信息", 服务器龙头
    '603501',  # "韦尔股份", 电源管理IC龙头
    '002938',  # "鹏鼎控股", 消费电子PCB龙头
    '002600',  # "领益智造", 电子元器件龙头

    '688111',  # "金山办公", 办公软件龙头
    '300433',  # "蓝思科技", 手机屏幕龙头
    '603986',  # "兆易创新", 存储器龙头
    '600183',  # "生益科技", 覆铜板龙头
    '300383',  # "光环新网", IDC龙头
    '600536',  # "中国软件", 国产操作系统龙头
    '601231',  # "环旭电子", 消费电子电池龙头
    '600584',  # "长电科技", 半导体设备龙头
    '300308',  # "中际旭创", 光模块龙头

    '603290',  # "斯达半导", 国内IGBT龙头
    '300661',  # "圣邦股份", 模拟芯片龙头
    '300373',  # "扬杰科技", 第三代半导体龙头
    '300666',  # "江丰电子", 靶材行业龙头
    '002236',  # "大华股份", 安防视频监控龙头
    '300623',  # "捷捷微电", 汽车分立器龙头
    '300349',  # "金卡智能", 智能燃气表龙头
    '002079',  # "苏州固锝", 二极管龙头
    '603688',  # "石英股份", 石英耗材龙头

    '002119',  # "康强电子", 半导体封装龙头
    '603005',  # "晶方科技", TSV封装龙头
    '688008',  # "澜起科技", 国产芯片龙头
    '688002',  # "睿创微纳", 红外探测器龙头
    '688099',  # "晶晨股份", 多媒体芯片龙头
    '002185',  # "华天科技", 芯片封测龙头
    '300567',  # "精测电子", 面板显示检测龙头

    '300474',  # "景嘉微", 国内GPU领军企业
    '002745',  # "木林森", LED封装龙头国内第一
    '300296',  # "利亚德", 光学巨头
    '300024',  # "机器人", 国内工业机器人产业先驱
    '300672',  # "国科微", 广播电视系列芯片和智能监控系列芯片行业龙头
    '603078',  # "江化微", 湿电子化学品的行业龙头
    '002876',  # "三利谱", 偏光片行业龙头
    '603896',  # "寿仙谷", 灵芝行业龙头
    '002161',  # "远望谷", 国内铁路RFID市场垄断地位
    '300053',  # "欧比特", 国内航天航空及军工领域龙头企业
    '300065',  # "海兰信", 国内最大的VDR制造企业

    '000858',  # "五粮液",
    '000876',  # "新希望",
    '300999',  # "金龙鱼",
    '300033',  # "同花顺",
    '000002',  # "万科A",
    '002032',  # "苏泊尔",
    '002594',  # "比亚迪",
    '600859',  # "王府井",
    '002588',  # "史丹利",
    '600720',  # "祁连山",
    '002294',  # "信立泰",

    '300054',  # "鼎龙股份", 打印复印耗材产业链龙头
    '300398',  # "飞凯材料", 电子化学品及液晶材料双龙头
    '300327',  # "中颖电子", 家电主控单芯片MCU龙头
    '002432',  # "九安医疗", 智能医疗龙头
    '002273',  # "水晶光电", 国内光电子产业世界领跑者
    '300012',  # "华测检测", 国内民营第三方检测的龙头企业
    '002044',  # "美年健康", 国内专业体检领域龙头
    '603978',  # "深圳新星", 铝钛硼晶粒细化剂行业龙头，行业内唯一一家拥有完整产业链的铝晶粒细化剂专业制造商

    '300648',  # "星云股份", 锂电池检测系统的行业龙头
    '300691',  # "联合光电", 高端光学镜头的行业龙头
    '300699',  # "光威复材", 碳纤维行业龙头
    '300700',  # "岱勒新材", 金刚石线的行业龙头
    '000823',  # "超声电子", 汽车电子PCB龙头
    '603595',  # "东尼电子", 超微细合金线材的行业龙头
    '002901',  # "大博医疗", 骨科植入类医用耗材领域的龙头企业

    '300603',  # "立昂技术", 新疆地区的安防龙头
    '300620',  # "光库科技", 光纤器件的行业龙头
    '300689',  # "澄天伟业", 智能卡的行业龙头
    '300653',  # "正海生物", 再生医学领域行业龙头
    '002022',  # "科华生物", 国内体外临床诊断行业龙头企业
    '002028',  # "思源电气", 国内最大电力保护设备消弧线圈生产商
    '002030',  # "达安基因", 国内核酸诊断试剂领域领先者
    '002063',  # "远光软件", 国内电力财务软件龙头企业
    '002073',  # "软控股份", 国内轮胎橡胶行业软件龙头企业
    '002104',  # "恒宝股份", 国内智能卡行业龙头企业

    '002106',  # "莱宝高科", 国内彩色滤光片行业龙头企业
    '002117',  # "东港股份", 国内规模最大商业票据印刷企业
    '002151',  # "北斗星通", 国内最大港口集装箱机械导航系统提供商
    '002179',  # "中航光电", 国内最大军用连接器制造企业
    '002449',  # "国星光电", 国内LED封装龙头企业
    '300007',  # "汉威电子", 国内气体传感器领先企业
    '300011',  # "鼎汉技术", 国内轨道交通电源系统龙头企业
    '300045',  # "华力创通", 国内计算机仿真行业领先企业
    '300046',  # "台基股份", 国内大功率半导体龙头企业
    '300074',  # "华平股份", 国内领先的多媒体通信系统提供商
    '300075',  # "数字政通", 国内数字化城市管理领域龙头
    '300077',  # "国民技术", 国内USBKEY领域龙头企业

    '600519',  # "贵州茅台",
    '600809',  # "山西汾酒",
    '601100',  # "恒立液压",
    '603638',  # "艾迪精密",
    '002714',  # "牧原股份",
    '002124',  # "天邦股份",
    '600966',  # "博汇纸业",
    '000488',  # "晨鸣纸业",
    '002511',  # "中顺洁柔",

    '000848',  # "承德露露",
    '603156',  # "养元饮品",
    '000639',  # "西王食品",
    '000505',  # "京粮控股",
    '000895',  # "双汇发展",
    '002515',  # "金字火腿",
    '002726',  # "龙大肉食",
    '300059',  # "东方财富",

    '600030',  # "中信证券",
    '601318',  # "中国平安",
    '601628',  # "中国人寿",
    '601601',  # "中国太保",
    '000001',  # "平安银行",
    '600036',  # "招商银行",
    '002142',  # "宁波银行",
    '600048',  # "保利地产",
    '601012',  # "隆基股份",
    '601636',  # "旗滨集团",
    '002129',  # "中环股份",

    '300015',  # "爱尔眼科",
    '300622',  # "博土眼鏡",
    '300595',  # "欧普康视",
    '600763',  # "通策医疗",
    '002241',  # "歌尔股份",
    '002475',  # "立讯精密",
    '002975',  # "博杰股份",
    '603288',  # "海天味业",
    '600872',  # "中炬高新",
    '603027',  # "千禾味业",
    '000333',  # "美的集团",

    '000651',  # "格力电器",
    '600887',  # "伊利股份",
    '600597',  # "光明乳业",
    '002460',  # "赣锋锂业",
    '002466',  # "天齐锂业",
    '300122',  # "智飞生物",
    '002007',  # "华兰生物",

    '300142',  # "沃森生物",
    '000661',  # "长春高新",
    '300009',  # "安科生物",
    '300357',  # "我武生物",
    '600276',  # "恒瑞医药",
    '000513',  # "丽珠集团",
    '603127',  # "昭衍新药",
    '002271',  # "东方雨虹",
    '300737',  # "科顺股份",
    '300715',  # "凯伦股份",

    '002352',  # "顺丰控股",
    '600233',  # "圆通速递",
    '002468',  # "申通快递",
    '600309',  # "万华化学",
    '000830',  # "鲁西化工",
    '600426',  # "华鲁恒升",
    '600900',  # "长江电力",
    '600025',  # "华能水电",
    '600744',  # "华银电力",
    '601633',  # "长城汽车",
    '600166',  # "福田汽车",
    '601888',  # "中国中免",
    '000886',  # "海南高速",
    '600031',  # "三一重工",

    '000157',  # "中联重科",
    '000425',  # "徐工机械",
    '000830',  # "鲁西化工",
    '688981',  # "中芯国际",
    '603501',  # "韦尔股份",
    '600988',  # "赤峰黄金",
    '000975',  # "银泰黄金",
    '600547',  # "山东黄金",
    '601088',  # "中国神华",
    '600121',  # "郑州煤电",

    '601015',  # "陕西黑猫",
    '600585',  # "海螺水泥",
    '000672',  # "上峰水泥",
    '600690',  # "海尔智家",
    '000100',  # "TCL科技",
    '600707',  # "彩虹股份",
    '300003',  # "乐普医疗",

    '002382',  # "蓝帆医疗",
    '601668',  # "中国建筑",
    '002941',  # "新疆交建",
    '601390',  # "中国中铁",
    '603993',  # "洛阳钼业",
    '300618',  # "寒锐钴业",
    '603799',  # "华友钴业"
    

]
